правки + output
